In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [25]:
df=pd.read_csv("age_of_marriage_data.csv")

In [26]:
df.head()

,id,gender,height,religion,caste,mother_tongue,profession,location,country,age_of_marriage
0,1,female,"5'4""",NaN,others,Telugu,NaN,London,United Kingdom,21.0
1,2,male,"5'7""",Jain,Shwetamber,Gujarati,Doctor / Healthcare Professional,Fairfax- VA,USA,32.0
2,3,male,"5'7""",Hindu,Brahmin,Hindi,Entrepreneurs / Business,Begusarai,India,32.0
3,4,female,"5'0""",Hindu,Thakur,Hindi,Architect,Mumbai,India,30.0
4,5,male,"5'5""",Christian,Born Again,Malayalam,Sales Professional / Marketing,Sulthan Bathery,India,30.0

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2567 entries, 0 to 2566
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               2567 non-null   int64
 1   gender           2538 non-null   object
 2   height           2449 non-null   object
 3   religion         1932 non-null   object
 4   caste            2425 non-null   object
 5   mother_tongue    2403 non-null   object
 6   profession       2237 non-null   object
 7   location         2412 non-null   object
 8   country          2551 non-null   object
 9   age_of_marriage  2548 non-null   float64
dtypes: float64(1), int64(1), object(8)
memory usage: 200.7+ KB

In [20]:
print(df.shape)
df.isna().sum()

(2567, 10)

id                   0
gender              29
height             118
religion           635
caste              142
mother_tongue      164
profession         330
location           155
country             16
age_of_marriage     19
dtype: int64

In [28]:
df.dropna(inplace=True)
print(df.shape)

(1932, 10)

In [29]:
df.columns

Index(['id', 'gender', 'height', 'religion', 'caste', 'mother_tongue',
       'profession', 'location', 'country', 'age_of_marriage'],
      dtype='object')

In [35]:
x=df.loc[:,['gender','height', 'religion', 'caste', 'mother_tongue','country']]

In [36]:
y=df.age_of_marriage

In [37]:
x.head()

   gender height   religion        caste mother_tongue country
1    male   5'7"       Jain   Shwetamber      Gujarati     USA
2    male   5'7"      Hindu      Brahmin         Hindi   India
3  female   5'0"      Hindu       Thakur         Hindi   India
4    male   5'5"  Christian   Born Again     Malayalam   India
5    male   5'5"      Hindu      Valmiki         Hindi   India

In [38]:
# We will use LabelEncoder
from sklearn.preprocessing import LabelEncoder
encode=LabelEncoder()
x.loc[:,['gender', 'religion', 'caste', 'mother_tongue','country']]=\
x.loc[:,['gender', 'religion', 'caste', 'mother_tongue','country']].apply(encode.fit_transform)

In [39]:
x.head()

  gender height religion caste mother_tongue country
1      1   5'7"        2    34             6      19
2      1   5'7"        1    14             8       5
3      0   5'0"        1    36             8       5
4      1   5'5"        0    13            13       5
5      1   5'5"        1    38             8       5

In [45]:
def height(h):
    return int(h.split('\'')[0])*30.48+\
    int(h.split('\'')[1].replace('"',''))*2.54

In [46]:
x["height_cm"]=x.height.apply(height)

In [47]:
x.head()

  gender height religion caste mother_tongue country  height_cm
1      1   5'7"        2    34             6      19     170.18
2      1   5'7"        1    14             8       5     170.18
3      0   5'0"        1    36             8       5     152.40
4      1   5'5"        0    13            13       5     165.10
5      1   5'5"        1    38             8       5     165.10

In [49]:
x.drop('height',axis=1,inplace=True)

In [50]:
x.head()

  gender religion caste mother_tongue country  height_cm
1      1        2    34             6      19     170.18
2      1        1    14             8       5     170.18
3      0        1    36             8       5     152.40
4      1        0    13            13       5     165.10
5      1        1    38             8       5     165.10

In [51]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=0)

In [60]:
from sklearn.ensemble import RandomForestRegressor
model=RandomForestRegressor(n_estimators=100,max_depth=11)
model.fit(x_train,y_train)
y_predict=model.predict(x_test)

In [61]:
from sklearn.metrics import mean_absolute_error,r2_score
print("MAE : ",mean_absolute_error(y_test,y_predict))
print("r2_score : ",r2_score(y_test,y_predict))

MAE :  1.032964165191602
r2_score :  0.6998243479735342

Export Model

In [66]:
import joblib
joblib.dump(model,'marriage_age_predict_model.ml')

['marriage_age_predict_model.ml']